Revit 2026 API

# UpdaterRegistryGetIsUpdaterOptional Method

---

Check if the updater is optional or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool GetIsUpdaterOptional(
	UpdaterId id
)
```
```vb
Public Shared Function GetIsUpdaterOptional (
	id As UpdaterId
) As Boolean
```
```cpp
public:
static bool GetIsUpdaterOptional(
	UpdaterId^ id
)
```
```fsharp
static member GetIsUpdaterOptional :
        id : UpdaterId -> bool
```

#### Parameters

id UpdaterId
     Id of the updater to check

#### Return Value

Boolean Returns True if the updater is optional, False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | Updater with this Id is not currently registered in Revit. |
| ArgumentNullException | A non-optional argument was null |

This flag controls whether an updater is going to be required next time a document in which it had been used is opened. If a non-optional updater is not found (currently not registered) in a document, the end user will be presented with a warning and choices to resolve the situation.

#### Reference

UpdaterRegistry Class

Autodesk.Revit.DB Namespace